package test;

/*
 * [문제]
 * 컴퓨터가 생성한 10 ~ 20 사이의 랜덤 값을 맞추시오
 * 마지막에는 사용자가 랜덤값을 몇 번 만에 맞췄는지(횟수) 출력하시오.
 * 
 * <출력 문구>
 * *** 숫자를 맞추어 보세요(10 ~ 20) ***
 * 
 * 숫자 입력 : 3
 * 10 ~ 20 사이의 정수를 입력하세요.
 * 숫자 입력 : 13
 * 컴퓨터의 숫자가 더 큽니다.
 * 숫자 입력 : 20
 * 컴퓨터의 숫자가 더 작습니다.
 * 숫자 입력 : 18
 * 4번만에 정답입니다.
 * 
 * 2-1. 정수형 변수 random 을 선언하여, 10 ~ 20 사이의 랜덤값을 저장하시오. [5점]
 * 2-2. 사용자가 입력한 값과 랜덤값을 비교 후 출력하시오. [5점]
 * 2-3. 사용자가 랜덤값을 맞출 때까지 정수를 입력하도록 하시오. [10점]
 * 2-4. 사용자가 몇 번만에 랜덤값을 맞췄는지 출력하시오. [10점]
 */

public class Test02 {

	public static void main(String[] args) {

		
		
	}
}
